import React from 'react'
import Navbar from './Navbar' 
import './Content.css'
import 'bootstrap/dist/css/bootstrap.css'

function contect() {
  return (
    <div>contect
    <Navbar/>
    <title>เนื้อหา - WorldTree</title>
        <div class="Content">
           <div class="Content-center">
             <p>
                    <span>๑. ชื่อโครงงาน</span> เว็บไซต์เล่นเกมส์  WorldTree <br/>
                    <div class="para-content"><span>๒. ผู้รับผิดชอบทำโครงงาน</span> <br/>
                        <div class="para">๒.๑. ๖๔๒๐๒๐๔๐๐๐๒ นายจตุรภัทร ปัญญาแดง     ปวช.๓ คอมพิวเตอร์ธุรกิจ </div>
                        <div class="para">๒.๒. ๖๔๒๐๒๐๔๐๐๑๑ นายวิทวัส ยี่สุ่นเทศ 	      ปวช.๓ คอมพิวเตอร์ธุรกิจ </div>
                        <div class="para">๒.๓. ๖๔๒๐๒๐๔๐๐๔๐ นายณัฐวุฒิ เชื้อไทย	    ปวช.๓ คอมพิวเตอร์ธุรกิจ </div>
                   </div><br/>
                 <span>๓. ที่มาและความสำคัญ</span><br/>
                 <span class="para">       เว็บไซต์ WorldTree ได้รับแรงบันดาลใจมาจากการตระหนักถึงความสำคัญของการทำให้การเรียนรู้เป็นสนุกและน่าสนใจเพื่อให้ผู้เรียนมีความกระตือรือร้นต่อการศึกษา การเรียนรู้ที่มีความสนุกสนามและน่าสนใจมีโอกาสมากที่จะผลิตผู้เรียนที่มีความท้าทาย มีแรงจูงใจ และมีความคิดสร้างสรรค์<br/></span>
                 <span class="para">การสร้างเว็บไซต์สำหรับเล่นเกมเป็นการนำความสนุกและการศึกษามารวมกันอย่างลงตัว แนวคิดนี้ช่วยให้การเรียนรู้ส่งเสริมความสนใจในการศึกษา การให้ประสบการณ์การเรียนรู้ที่มีความท้าทายและสามารถปรับตัวได้ตามระดับความสามารถของผู้ใช้ช่วยในการสร้างการเรียนรู้ที่เน้นที่ความสามารถทางภาษา<br/></span>
                 <span class="para">ดังนั้นผู้จัดทำจึงได้นำโครงงานเว็บไซต์เล่นเกมส์เพื่อให้นำเสนอความสนุกกับเกมส์ให้เหมาะสมกับเทคโนโลยีในยุคปัจจุบัน เพื่อให้ผู้บริโภคได้รับความรู้อย่างมีประสิทธิภาพมากขึ้น</span>  
                    <div class="para-content"><span>๔. วัตถุประสงค์</span>
                        <div class="para">๔.๑. เพื่อลดความเครียดให้แก่ผู้ใช้ </div>
                        <div class="para">๔.๒. เพื่อนำทักษะภายในเกมส์ออนไลน์ให้แก่ผู้ใช้</div>
                     <div class="para"> ๔.๓. เพื่อตามหาเกมส์ออนไลน์ที่ผู้ใช้ต้องการ</div>
                  </div>
                    <span>๕. เป้าหมาย</span><br/>
                    <span class="para">เพื่อเป็นศูนย์รวบรวมความรู้ผ่านเกมส์ออนไลน์</span><br/>
                        <div class="para"><span>๕.๑ เชิงปริมาณ</span>
                             <div class="para">๕.๑.๑. WorldTree มีเว็บไซต์เล่นเกมออนไลน์ผ่านอินเตอร์เน็ต จำนวน ๑ เว็บไซต์</div>
                             <div class="para">๕.๑.๒. ทดสอบเว็บไซต์กับบุคลากรภายในวิทยาลัย จำนวน ๒๐ คน</div>
                             <div class="para">๕.๑.๓. จำนวนผู้ใช้เข้าชมเว็บไซต์ จำนวน ๕๐ คน</div>
                       </div>
                    <div class="para"><span>๕.๒ เชิงคุณภาพ</span>
                        <div class="para">๕.๒.๑. ศึกษาหาความรู้ภายในเว็บไซต์ได้</div>
                        <div class="para">๕.๒.๒. ผู้ที่สนใจในการเล่นเกมส์</div>
                  </div>
                    <span>๖. ประโยชน์ที่ได้รับ</span>
                        <div class="para">๖.๑. ได้รับผ่อนคลายความเครียด</div>
                        <div class="para">๖.๒. สามารถนำทักษะในระหว่างเล่นเกมส์นำไปเพื่อต่อยอดได้</div>
                        <div class="para">๖.๓. ให้อิสระในการตามหาเกมส์ที่ต้องการจะเล่นได้อย่างรวดเร็ว</div>
                    <span>๗. ขอบเขตของโครงงาน</span>
                        <div class="para"> ๗.๑. เครื่องมือในการสร้างเว็บไซต์ ได้แก่ Visual Studio Code, Node.js , Photoshop , firebase </div>
                        <div class="para"> ๗.๒. รวบรวมข้อมูลที่จำเป็นเพื่อทำเว็บไซต์โดยการเข้าชม youtube ในการบริหารจัดการเว็บไซต์</div>
                        <div class="para"> ๗.๓. ศึกษาเว็บไซต์ที่ใกล้เคียงกับโครงงานเพื่อใช้ให้เว็บไซต์ดียิ่งขึ้น</div>
                   <span>๘. ขั้นตอนการดำเนินงาน</span>
                    <div class="para">๘.๑. รวบรวมข้อมูลอย่างละเอียด</div>
                    <div class="para">๘.๒. ค้นคว้าเกมที่น่าสนใจที่คาดว่าได้รับประโยชน์</div>
                    <div class="para">๘.๓. วางแผนการจัดทำโครงงาน</div>
                    <div class="para">๘.๔. วิเคราะห์ระบบข้อมูลที่ต้องการ</div>
                    <div class="para">๘.๕. ออกแบบเว็บไซต์และสร้างเว็บไซต์</div>
                 <div class="para">๘.๖. ทดสอบและปรับปรุงเว็บไซต์</div>
                 <div class="para">๘.๗. ออกแบบและจัดทำโครงงาน</div>
                    <div class="para">๘.๘. นำเสนอโครงงาน</div>
                    <span>๙. ระยะเวลาในการดำเนินโครงงาน</span><br/>
                   <div class="para">เริ่มโครงงานวันที่ ๑๙ ตุลาคม .พ.ศ. ๒๕๖๖ สิ้นสุดวันที่ ๑๙ กุมภาพันธ์ .พ.ศ. ๒๕๖๖<br/></div>
                    <span>๑๐. งบประมาณค่าใช้จ่าย</span><br/>
                    <div class="para">งบประมาณ จำนวน ๕๐๐ บาท (โดยประมาณ)<br/></div>
                  <span>๑๑. การติดตามและประเมินผลโครงงาน</span><br/>
                    <div class="para">แบบประเมินความพึงพอใจภายในเว็บไซต์<br/></div>
               </p>
            </div>
          </div>
    </div>
    )
}

export default contect